ПД_sev/src/Documents/ПрочиеЗатраты/ПрочиеЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрочиеЗатраты</name>
  <basedOn>Catalog.Проекты</basedOn>
  <registerRecords>AccumulationRegister.Начисления</registerRecords>
  <registerRecords>AccumulationRegister.ПрибыльПоПроектам</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.МП_ВнешниеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаКомпенсацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПД_sev/src/Documents/ПрочиеЗатраты/ManagerModule.bsl
Функция СоздатьОбновитьДокументПрочиеЗатраты(стрПараметры) Экспорт 
	ДокументОбъект = Документы.ПрочиеЗатраты.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Сотрудник = стрПараметры.Сотрудник;//ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	ДокументОбъект.Проект = стрПараметры.Проект;
	ДокументОбъект.Согласовано = Ложь;
	ДокументОбъект.Комментарий = стрПараметры.Комментарий;
	//ДокументОбъект.ТСД = ссылкаТСД; 
	
	НовыйТовар = ДокументОбъект.Товары.Добавить();
	НовыйТовар.Наименование = стрПараметры.НаименованиеЗатраты;
	НовыйТовар.Количество = 1;
	НовыйТовар.Цена = стрПараметры.Сумма;
	НовыйТовар.Сумма = стрПараметры.Сумма;
	НовыйТовар.НаКомпенсацию = Истина;

	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ДокументОбъект.Ссылка;
КонецФункции
